In [37]:
import pandas as pd
af = pd.read_csv('Book2.csv')

In [50]:
df2 = af

In [38]:
af["Name"]

0    A
1    B
2    C
3    D
4    E
5    F
Name: Name, dtype: object

In [39]:
af#.Name

  Name  Agbe       City
0    A    24     Queens
1    B    34  Manhattan
2    C    30     Queens
3    D    34  Manhattan
4    E    34  Manhattan
5    F    20  Manhattan

In [40]:
af[af.Name=='D']

  Name  Agbe       City
3    D    34  Manhattan

In [ ]:
#Filtering

In [41]:
af
#select * from df where Name = 'D'
#

  Name  Agbe       City
0    A    24     Queens
1    B    34  Manhattan
2    C    30     Queens
3    D    34  Manhattan
4    E    34  Manhattan
5    F    20  Manhattan

In [60]:
x = af.Agbe[af.City=='Manhattan']
x

1    34
3    34
4    34
5    20
Name: Agbe, dtype: int64

In [58]:
af.City=='Manhattan'

0    False
1     True
2    False
3     True
4     True
5     True
Name: City, dtype: bool

In [64]:
af [af['City']=='Manhattan']

  Name  Agbe       City
1    B    34  Manhattan
3    D    34  Manhattan
4    E    34  Manhattan
5    F    20  Manhattan

In [25]:
x = 1

In [26]:
x

1

In [28]:
x==2

False

In [69]:
af.groupby(['City']).mean()

           Agbe
City
Manhattan  30.5
Queens     27.0

In [70]:
#select avg(Age), city group by city

In [72]:
import numpy as np
import pandas as pd
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [73]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data
data.dropna()

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.0
2    3.5
4    7.0
dtype: float64

In [76]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [95]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [97]:
data.fillna({1: 0.5, 2: 0})

#data.dropna()

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.5  0.0
2  NaN  0.5  0.0
3  NaN  6.5  3.0

In [79]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
#Inplace ------

In [81]:
data.dropna(how='any')

     0    1    2
0  1.0  6.5  3.0

In [82]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [94]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [87]:
np.random.seed(12345)


df = pd.DataFrame(np.random.randn(7, 3))
df#["0"]

          0         1         2
0 -0.204708  0.478943 -0.519439
1 -0.555730  1.965781  1.393406
2  0.092908  0.281746  0.769023
3  1.246435  1.007189 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [90]:
df.iloc[:4, 1] # = NA
df.iloc[4, 1]
df.iloc[4:, 1]

4    0.228913
5   -2.001637
6   -0.438570
Name: 1, dtype: float64

In [ ]:
df.iloc[:2, 2] = NA
df
df.dropna()
df.dropna(thresh=2)

In [91]:
x = [1,2,3,4,5]

x[1]

2

In [92]:
x[4]

5

In [93]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.204708  0.478943 -0.519439
1 -0.555730  1.965781  1.393406
2  0.092908  0.281746  0.769023
3  1.246435  1.007189 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [98]:
data.fillna(0, inplace=True)

In [99]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [101]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})

   data2 key
0      0   a
1      1   b
2      2   d

In [102]:
df1
#df2

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [103]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [104]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [105]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [106]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [107]:
s1

a    0
b    1
dtype: int64

In [109]:
s2

c    2
d    3
e    4
dtype: int64

In [110]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [111]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [112]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],
                    name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [113]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [114]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

      data1     data2 key1 key2
0 -0.713544  0.560145    a  one
1 -0.831154 -1.265934    a  two
2 -2.370232  0.119827    b  one
3 -1.860761 -1.063512    b  two
4 -0.860757  0.332883    a  one

In [117]:
grouped = df.groupby(df['key1'])
grouped

In [118]:
grouped.mean()

         data1     data2
key1
a    -0.801818 -0.124302
b    -2.115496 -0.471843

In [119]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -0.787151
      two    -0.831154
b     one    -2.370232
      two    -1.860761
Name: data1, dtype: float64

In [125]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005   -0.831154
            2006   -2.370232
Ohio        2005   -1.287152
            2006   -0.860757
Name: data1, dtype: float64

In [126]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe    -2.359419 -0.199543 -1.541996 -0.970736 -1.307030
Steve   0.286350  0.377984 -0.753887  0.331286  1.349742
Wes     0.069877  0.246674 -0.011862  1.004812  1.327195
Jim    -0.919262 -1.549106  0.022185  0.758363 -0.660524
Travis  0.862580 -0.010032  0.050009  0.670216  0.852965

In [129]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [130]:
people

               a         b         c         d         e
Joe    -2.359419 -0.199543 -1.541996 -0.970736 -1.307030
Steve   0.286350  0.377984 -0.753887  0.331286  1.349742
Wes     0.069877       NaN       NaN  1.004812  1.327195
Jim    -0.919262 -1.549106  0.022185  0.758363 -0.660524
Travis  0.862580 -0.010032  0.050009  0.670216  0.852965